{
    "products": [
        {
            "id": 1,
            "title": "R7",
            "thumbnail": "R7.jpg",
            "sub": [
                
            ],
            "desc": "Το R-7 είναι η κορυφαία επιλογή για όσους χρειάζονται αναπηρικό αμαξίδιο. Κατασκευασμένο κατά παραγγελία για απόλυτη εξατομίκευση,από ελαφρύ κράμα  αλουμινίου αεροναυπηγικής σειρά Τ6 7020 για σταθερότητα και αντοχή. Ο άκαμπτός σκελετός, η πτυσσόμενη πλάτη και οι αποσπώμενοι τροχοί προσφέρουν ευκολία στη χρήση και μεταφορά. Με πολλές ρυθμίσεις προσαρμογής όπως ύψος υποποδίου, γωνία πλάτης και κέντρο βάρους, προσφέρει άνεση και σταθερότητα. Σε μεγάλή επιλογή χρωμάτων είναι η ιδανική επιλογή για αυτούς που αναζητούν μια πρακτική και προσαρμοσμένη λύση προσαρμοσμένη στον τρόπο ζωής τους",
            "chars": [
                {"skel_weight": "4.3kg"},
                {"skel_type": "Σκελετός αλουμινίου 7020 Τ6"},
                {"wheels": "spinergy"},
                {"wheel_size": ["3", "4", "5"]},
                {"breaks_type": ["scissor", "push to brake"]},
                {"misc_details": [
                    "Πλαϊνά αλουμινίου",
                    "Αεριζόμενη ταπετσαρία υψηλής αντοχής",
                    "Ρυθμιζόμενο ύψος υποποδίου",
                    "Ρυθμιζόμενη γωνίας πλάτης",
                    "Ρυθμιζόμενο κέντρο βάρους +2 -2"
                ]}
            ]
        },
        {
            "id": 2,
            "title": "S7",
            "thumbnail": "S7.jpg",
            "sub": [
                "S7sub1.jpg",
                "S7sub2.jpg",
                "S7sub3.jpg",
                "S7sub4.jpg",
                "S7sub5.jpg"
            ],
            "desc": "Το S-7 ενσωματώνει τον σχεδιασμό, την εργονομία και την βέλτιστη κύλιση τύπου S. Κατασκευασμένο κατά παραγγελία για απόλυτη εξατομίκευση. Ο σκελετός αλουμινίου σειράς Τ6 7020  αεροναυπηγικής προσφέρει σταθερότητα και αντοχή. Πτυσσόμενη πλάτη και αποσπώμενοι τροχοί καθιστούν τη χρήση εύκολη σε κάθε μετακίνηση . Με πολλές ρυθμίσεις για άνεση και βέλτιστη καθιστή θέση, το S-7 είναι μια ιδανική λύση για ένα αμαξίδιο σταθερού σκελετού προσαρμοσμένη στα \"μέτρα\" σου.",
            "chars": [
                {"skel_weight": "4.3kg"},
                {"skel_type": "Σκελετός αλουμινίου 7020 Τ6"},
                {"wheels": "spinergy"},
                {"wheel_size": ["3", "4", "5"]},
                {"breaks_type": ["scissor", "push to brake"]},
                {"misc_details": [
                    "Πλαϊνά αλουμινίου",
                    "Αεριζόμενη ταπετσαρία υψηλής αντοχής",
                    "Ρυθμιζόμενο ύψος υποποδίου",
                    "Ρυθμιζόμενη γωνίας πλάτης",
                    "Ρυθμιζόμενο κέντρο βάρους +2 -2"
                ]}
            ]
        }
    ]
}