import React from "react";
import { Box, Stack, Alert, Typography } from "@mui/material";
import inter from '../../assets/interior5.jpg';
import TitleComp from "./TitleComp";
import RedirectBox from "./RedirectBox";
import ImageComp from "./ImageComp";
import TextWindow from "./TextWindow";

const Interior = () => {
    return(
        <Box sx={{ paddingBottom: 5 }}>  
            <ImageComp image={inter}/>
            <Alert severity="success">
                        Η προσβασιμότητα δεν αφορά μόνο μεγάλες κατασκευές ή υψηλού κόστους τροποποιήσεις. Πολλές φορές, μικρές αλλά στοχευμένες παρεμβάσεις μπορούν να κάνουν τη διαφορά.
                    </Alert>
            <TitleComp text={'Διαμόρφωση Χώρου'}/>        
            <Box sx={{ marginLeft: {xl: 70, lg: 15, md: 5, sm: 5, xs: 3, xxs: 2}, marginRight: {xl: 70, lg: 15, md: 5, sm: 5, xs: 3, xxs: 2}, display: 'flex', justifyContent: 'center', bgcolor: 'rgb(255, 250, 240)', padding: 3, borderRadius: 2, border: '1px solid rgb(180, 180, 180)' }}>
                <Typography sx={{ color: 'rgb(40, 40, 40)' }}>
                    Η διαμόρφωση του χώρου ενός σπιτιού για τα άτομα που ζουν σε συνθήκες
                    αναπηρίας είναι ένα από τα πιο σημαντικά στοιχεία για την καθημερινή τους
                    αυτονομία και την ποιότητα ζωής. Ένας σωστά διαμορφωμένος χώρος μπορεί να
                    μειώσει δραματικά την ανάγκη για βοήθεια, ενισχύοντας παράλληλα την
                    αυτοπεποίθηση του ατόμου. Όταν το περιβάλλον του σπιτιού είναι σχεδιασμένο
                    ώστε να ανταποκρίνεται στις ατομικές ανάγκες και προκλήσεις, το άτομο μπορεί να
                    κινηθεί με μεγαλύτερη άνεση, να εκτελεί βασικές καθημερινές δραστηριότητες χωρίς
                    εμπόδια και να απολαμβάνει την ανεξαρτησία του.
                </Typography>               
            </Box>
            <Box sx={{ marginTop: 6, marginLeft: {xl: 70, lg: 15, md: 5, sm: 5, xs: 3, xxs: 2}, marginRight: {xl: 70, lg: 15, md: 5, sm: 5, xs: 3, xxs: 2} }}>
                <Stack spacing={6}>
                    <Stack spacing={6} sx={{ display: 'flex', justifyContent: 'center', padding: 5, borderRadius: 3, border: '1px solid rgb(180, 180, 180)', bgcolor: 'rgb(232, 226, 232)' }}>
                        <Typography variant='h6' sx={{ fontWeight: 'bold', color: 'rgb(40, 40, 40)' }}>
                            Η Σημασία της Προσαρμογής του Χώρου
                        </Typography> 
                        <Stack spacing={3}>
                            <TextWindow title={'Μείωση της Εξάρτησης από Άλλους'} text={'Ένα σπίτι που έχει σχεδιαστεί με γνώμονα την προσβασιμότητα μπορεί να βοηθήσει τα άτομα με αναπηρία να εκτελούν καθημερινές δραστηριότητες με μεγαλύτερη ευκολία, όπως η μετακίνηση από το ένα δωμάτιο στο άλλο, η χρήση της κουζίνας, η τουαλέτα ή το ντους. Με την προσθήκη κατάλληλων υποδομών, όπως ράμπες, ευρύχωρους διαδρόμους, προσαρμοσμένα έπιπλα και συσκευές, το άτομο μπορεί να μειώσει σημαντικά την ανάγκη για βοήθεια από άλλους​. Αυτό έχει ως αποτέλεσμα την αύξηση της αυτονομίας, καθώς το άτομο δεν χρειάζεται να βασίζεται συνεχώς σε φροντιστές ή μέλη της οικογένειας για τις βασικές του ανάγκες.'}/>
                            <TextWindow title={'Ασφάλεια και Άνεση'} text={'Ένας καλά σχεδιασμένος χώρος προσφέρει ασφάλεια και μειώνει τους κινδύνους ατυχημάτων, όπως πτώσεις ή χτυπήματα. Με ειδικά σχεδιασμένα σημεία στήριξης, αντιολισθητικά υλικά, προσβάσιμα έπιπλα και κατάλληλη διαμόρφωση των χώρων, η μετακίνηση γίνεται πιο ασφαλής και άνετη. Αυτή η ασφάλεια ενισχύει το αίσθημα της σιγουριάς και της αυτοπεποίθησης του ατόμου​.'}/>
                            <TextWindow title={'Αυτονομία στις Καθημερινές Δραστηριότητες'} text={'Η προσαρμογή του σπιτιού διευκολύνει την εκτέλεση βασικών καθημερινών δραστηριοτήτων, όπως το μαγείρεμα, η φροντίδα του εαυτού, η προσωπική υγιεινή και η μετακίνηση εντός του σπιτιού. Ο σωστός σχεδιασμός εξασφαλίζει ότι το άτομο μπορεί να διαχειρίζεται τις ανάγκες του χωρίς να χρειάζεται συνεχή βοήθεια, αυξάνοντας την ανεξαρτησία του​.'}/>
                            <TextWindow title={'Αύξηση της Αυτοπεποίθησης'} text={'Όταν ένα άτομο με αναπηρία μπορεί να κινηθεί και να ζήσει στο σπίτι του χωρίς περιορισμούς, αυτό έχει άμεσο αντίκτυπο στην αυτοεκτίμηση και την ψυχολογία του. Το να μπορεί να διαχειρίζεται τις ανάγκες του χωρίς εξωτερική βοήθεια, του δίνει μια αίσθηση αυτοδυναμίας και αξιοπρέπειας. Το περιβάλλον του σπιτιού γίνεται ένας χώρος όπου μπορεί να αισθάνεται ασφαλές και ανεξάρτητο, γεγονός που ενισχύει τη θετική του εικόνα για τον εαυτό του​.'}/>
                        </Stack>  
                    </Stack>            
                    <Stack spacing={6} sx={{ display: 'flex', justifyContent: 'center', padding: 5, borderRadius: 3, border: '1px solid rgb(180, 180, 180)', bgcolor: 'rgb(232, 226, 232)' }}>
                        <Typography variant='h6' sx={{ fontWeight: 'bold', color: 'rgb(40, 40, 40)' }}>
                            Η Υπηρεσία της GS Wheelchairs στη Διαμόρφωση του Χώρου
                        </Typography> 
                        <Box sx={{ marginTop: 6, marginLeft: {xl: 70, lg: 15, md: 5, sm: 5, xs: 3, xxs: 2}, marginRight: {xl: 70, lg: 15, md: 5, sm: 5, xs: 3, xxs: 2}, display: 'flex', justifyContent: 'center', bgcolor: 'rgb(255, 252, 252)', padding: 2, borderRadius: 2, border: '1px solid rgb(180, 180, 180)' }}>
                            <Typography sx={{ color: 'rgb(40, 40, 40)' }}>
                                Η GS Wheelchairs δεν ασχολείται μόνο με την κατασκευή εξατομικευμένων
                                αναπηρικών αμαξιδίων και τη λειτουργική αποκατάσταση. Προσφέρει επίσης
                                υπηρεσίες διαμόρφωσης εσωτερικών χώρων, ειδικά σχεδιασμένων για να
                                καλύπτουν τις ανάγκες των ατόμων με αναπηρία. Με στόχο να διευκολύνει τη ζωή
                                των χρηστών, η GS Wheelchairs δημιουργεί προσβάσιμους και εργονομικούς
                                χώρους, βοηθώντας τα άτομα να αποκτήσουν μεγαλύτερη ανεξαρτησία.
                            </Typography>                            
                        </Box>
                        <Stack spacing={3}>
                            <TextWindow title={'Εξατομικευμένες Λύσεις'} text={'Κάθε άτομο έχει διαφορετικές ανάγκες και η GS Wheelchairs αναγνωρίζει αυτή την ποικιλία. Η υπηρεσία διαμόρφωσης χώρου παρέχει πλήρως εξατομικευμένες λύσεις, λαμβάνοντας υπόψη το είδος της αναπηρίας, τις δυνατότητες του χρήστη και τις απαιτήσεις της καθημερινότητάς του. Αυτό μπορεί να περιλαμβάνει την εγκατάσταση ειδικών ραμπών, τη ρύθμιση των εσωτερικών χώρων ώστε να υπάρχει αρκετός χώρος για ελιγμούς με το αμαξίδιο, καθώς και την προσαρμογή των επίπλων και των συσκευών σε προσιτό ύψος​.'}/>
                            <TextWindow title={'Συνδυασμός Αισθητικής και Λειτουργικότητας'} text={'Η GS Wheelchairs δίνει ιδιαίτερη σημασία στο να διατηρήσει το σπίτι όμορφο και λειτουργικό. Οι προσαρμογές δεν γίνονται εις βάρος της αισθητικής, αλλά ενσωματώνονται με τρόπο που να εξασφαλίζει τόσο την πρακτικότητα όσο και τη φιλικότητα του χώρου προς τον χρήστη. Ένα σπίτι πρέπει να είναι ένας χώρος όπου το άτομο αισθάνεται άνετα, αλλά και ένας χώρος που του επιτρέπει να κινείται ελεύθερα​.'}/>
                            <TextWindow title={'Συμβουλευτική και Εκπαίδευση'} text={'Μέσω της υπηρεσίας διαμόρφωσης χώρου, η GS Wheelchairs προσφέρει επίσης συμβουλές και εκπαίδευση για τη βέλτιστη χρήση του σπιτιού. Οι ειδικευμένοι σύμβουλοι εργάζονται μαζί με το άτομο και την οικογένειά του για να σχεδιάσουν λύσεις που ταιριάζουν στις ανάγκες τους, διασφαλίζοντας ότι ο χώρος θα καλύπτει κάθε πτυχή της καθημερινότητας. Αυτή η διαδικασία δεν είναι απλώς τεχνική, αλλά εμπλέκει και το χρήστη, ώστε να αισθάνεται πως ο χώρος του είναι ακριβώς όπως τον χρειάζεται​​.'}/>
                        </Stack>      
                    </Stack>    
                    <Stack spacing={3} sx={{ display: 'flex', justifyContent: 'center', padding: 5, borderRadius: 3, border: '1px solid rgb(180, 180, 180)', bgcolor: 'rgb(232, 226, 232)' }}>
                        <Typography variant='h6' sx={{ fontWeight: 'bold', color: 'rgb(40, 40, 40)' }}>
                            Πώς η Προσαρμογή του Σπιτιού Ενισχύει την Αυτοπεποίθηση
                        </Typography> 
                        <Box sx={{ marginTop: 6, marginLeft: {xl: 70, lg: 15, md: 5, sm: 5, xs: 3, xxs: 2}, marginRight: {xl: 70, lg: 15, md: 5, sm: 5, xs: 3, xxs: 2}, display: 'flex', justifyContent: 'center', bgcolor: 'rgb(255, 252, 252)', padding: 2, borderRadius: 2, border: '1px solid rgb(180, 180, 180)' }}>
                            <Typography sx={{ color: 'rgb(40, 40, 40)' }}>
                                Η διαμόρφωση του χώρου δίνει στα άτομα με αναπηρία το αίσθημα ελέγχου στη ζωή
                                τους. Όταν το περιβάλλον του σπιτιού είναι προσβάσιμο και προσαρμοσμένο, το
                                άτομο μπορεί να διαχειρίζεται τις καθημερινές του ανάγκες με αυτονομία. Αυτό
                                οδηγεί σε μείωση του άγχους και της εξάρτησης, ενισχύοντας την αυτοπεποίθηση
                                και την αίσθηση της αξιοπρέπειας​.
                            </Typography>                            
                        </Box>
                        <Box sx={{ marginTop: 6, marginLeft: {xl: 70, lg: 15, md: 5, sm: 5, xs: 3, xxs: 2}, marginRight: {xl: 70, lg: 15, md: 5, sm: 5, xs: 3, xxs: 2}, display: 'flex', justifyContent: 'center', bgcolor: 'rgb(255, 252, 252)', padding: 2, borderRadius: 2, border: '1px solid rgb(180, 180, 180)' }}>
                            <Typography sx={{ color: 'rgb(40, 40, 40)' }}>
                                Η GS Wheelchairs προσφέρει ολοκληρωμένες λύσεις για τη διαμόρφωση του
                                σπιτιού, λαμβάνοντας υπόψη τόσο τη λειτουργικότητα όσο και την ψυχολογική
                                ευεξία του χρήστη. Το αποτέλεσμα είναι ένας χώρος όπου το άτομο μπορεί να ζει με
                                άνεση, ασφάλεια και ανεξαρτησία, βελτιώνοντας την καθημερινότητά του σε κάθε
                                επίπεδο.
                            </Typography>                            
                        </Box>
                    </Stack>         
                </Stack>    
            </Box>            
            <RedirectBox back={'/service/life-coaching'} forward={'/'} pd={90} last={true}/>
        </Box>
    );
}

export default Interior;