{
    "el": {
        "gs_title": "Καλωσήρθατε στη GS Wheelchairs",
        "gs_info": [
            "Στη GS Wheelchairs γνωρίζουμε ότι κάθε άτομο είναι διαφορετικό, και οι ανάγκες του ξεχωριστές. Για τον λόγο αυτό ειδικευόμαστε στην κατασκευή προσαρμοσμένων αναπηρικών αμαξιδίων, σχεδιασμένων αποκλειστικά για τις ανάγκες του κάθε ατόμου.",
            "Προσφέρουμε υπηρεσίες Life Coaching και Εκπαίδευσης σε θέματα αυτονομίας, από πιστοποιημένο εκπαιδευτή στη Σουηδία για άτομα με αναπηρία, και ειδικά για τραυματισμούς στην σπονδυλική στήλη.",
            "Επιπλέον, προσφέρουμε λύσεις για την προσαρμογή του εσωτερικού και εξωτερικού χώρου σας, παρέχοντας ιδέες και προτάσεις που θα βελτιώσουν το περιβάλλον σας. Αντιμετωπίζουμε τις προκλήσεις που συνοδεύουν την αναπηρία με εξειδικευμένες υπηρεσίες.",
            "Η εμπειρία μας ως άνθρωποι που ζουν σε συνθήκες αναπηρίας μας επιτρέπει να κατανοούμε πλήρως τις ανάγκες σας. Το Customize Your Life αποτελεί τη δέσμευσή μας για μια καλύτερη ποιότητα ζωής, πλήρως προσαρμοσμένη στις δικές σας ανάγκες."
        ],
        "autonomy": "Όταν εξετάζουμε το θέμα της αυτονομίας και των ατόμων με αναπηρία, γίνεται εμφανές ότι η προσβασιμότητα δεν είναι απλώς μια ευγενική ιδέα, αλλά ένα αναγκαίο στοιχείο που εξασφαλίζει την υψηλή ποιότητα ζωής. Η εμπειρία που έχουμε αποκτήσει μέσα σε περίπου τριάντα χρόνια αντιμετώπισης της αναπηρίας μας έχει διδάξει πόσο κρίσιμες μπορούν να είναι οι κατάλληλες παρεμβάσεις στον προσωπικό μας χώρο. Στο πλαίσιο αυτό, δημιουργήσαμε την GS με σκοπό να προσφέρουμε λύσεις που όχι μόνο επιδιώκουν την προσβασιμότητα, αλλά και βελτιώνουν πραγματικά την καθημερινή ζωή των ατόμων με αναπηρία. Είναι σημαντικό να σημειώσουμε ότι η προσβασιμότητα δεν περιορίζεται μόνο σε μεγάλα κτίρια ή ακριβές τροποποιήσεις. Συχνά, μικρές, αλλά στοχευμένες παρεμβάσεις μπορούν να καταφέρουν πολλά. Η προσθήκη λαβών σε στρατηγικά σημεία, η αναδιαμόρφωση των επίπλων και η λειτουργική αναδιάταξη μπορούν να απλοποιήσουν σημαντικά την καθημερινή ρουτίνα. Η γνώση που διαθέτουμε στον τομέα αποτελεί το ισχυρό μας εργαλείο για το να κατανοήσουμε βαθιά τις ανάγκες των ατόμων με αναπηρία και να προσφέρουμε πραγματικές βελτιώσεις στη ζωή τους. Τελικά, ο στόχος μας είναι να καταστήσουμε την προσβασιμότητα όχι μόνο εφικτή, αλλά και λειτουργική και εύκολη, καθώς γνωρίζουμε πόσο κρίσιμη είναι για την αυτονομία και την ποιότητα ζωής."
    },
    "en": {
        "autonomy": "When we examine the issue of autonomy and individuals with disabilities, it becomes evident that accessibility is not just a kind idea but a necessary element ensuring a high quality of life. The experience gained over approximately thirty years of dealing with our disability has taught us how crucial appropriate interventions in our personal space can be. That's why we created GS. Accessibility is not limited to large constructions or costly modifications. Often, small but targeted interventions can make a significant difference. Adding grips at strategic points, reconfiguring furniture, and functional rearrangements can simplify daily routines significantly. Our knowledge in the field is the powerful tool that allows us to deeply understand the needs of individuals with disabilities and offer solutions that bring real improvements to their lives. In conclusion, our goal is to make accessibility not only achievable but also functional and easy, as we understand how critical it is for autonomy and the quality of life."
    }
}